---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevision
source: html/343943df-b2e2-3450-7f94-a59d211c333a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SheetCurrentRevision Property

"Current Revision"

## Syntax (C#)
```csharp
public static ForgeTypeId SheetCurrentRevision { get; }
```